; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_9)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj6 obj7 - truck
	obj5 obj16 - location
	obj8 obj9 obj10 obj11 obj12 obj13 obj14 - package
	obj15 - airplane
)

(:init
	(at obj4 obj2)
	(at obj6 obj0)
	(at obj7 obj2)
	(at obj8 obj2)
	(at obj9 obj0)
	(at obj10 obj0)
	(at obj11 obj0)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj14 obj0)
	(at obj15 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj5 obj1)
	(in-city obj16 obj3)
)

(:goal (and
	(at obj8 obj5)
	(at obj9 obj16)
	(at obj10 obj2)
	(at obj11 obj16)
	(at obj12 obj16)
	(at obj13 obj0)
	(at obj14 obj2)
))
)

; plan
1. (drive obj4 obj2 obj16)
   deleted: (at obj4 obj2)
   added: (at obj4 obj16)
   goals met: 0 of 7
2. (load obj15 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj15)
   goals met: 0 of 7
3. (load obj15 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj15)
   goals met: 0 of 7
4. (load obj15 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj15)
   goals met: 0 of 7
5. (load obj15 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj15)
   goals met: 0 of 7
6. (load obj15 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj15)
   goals met: 0 of 7
7. (fly obj15 obj0 obj2)
   deleted: (at obj15 obj0)
   added: (at obj15 obj2)
   goals met: 0 of 7
8. (drive obj4 obj16 obj2)
   deleted: (at obj4 obj16)
   added: (at obj4 obj2)
   goals met: 0 of 7
9. (drive obj7 obj2 obj16)
   deleted: (at obj7 obj2)
   added: (at obj7 obj16)
   goals met: 0 of 7
10. (load obj15 obj13 obj2)
   deleted: (at obj13 obj2)
   added: (in obj13 obj15)
   goals met: 0 of 7
11. (load obj15 obj8 obj2)
   deleted: (at obj8 obj2)
   added: (in obj8 obj15)
   goals met: 0 of 7
12. (unload obj15 obj11 obj2)
   deleted: (in obj11 obj15)
   added: (at obj11 obj2)
   goals met: 0 of 7
13. (unload obj15 obj12 obj2)
   deleted: (in obj12 obj15)
   added: (at obj12 obj2)
   goals met: 0 of 7
14. (unload obj15 obj9 obj2)
   deleted: (in obj9 obj15)
   added: (at obj9 obj2)
   goals met: 0 of 7
15. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 7
16. (drive obj7 obj16 obj2)
   deleted: (at obj7 obj16)
   added: (at obj7 obj2)
   goals met: 0 of 7
17. (unload obj15 obj8 obj0)
   deleted: (in obj8 obj15)
   added: (at obj8 obj0)
   goals met: 0 of 7
18. (fly obj15 obj0 obj2)
   deleted: (at obj15 obj0)
   added: (at obj15 obj2)
   goals met: 0 of 7
19. (drive obj7 obj2 obj16)
   deleted: (at obj7 obj2)
   added: (at obj7 obj16)
   goals met: 0 of 7
20. (load obj4 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj4)
   goals met: 0 of 7
21. (load obj4 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj4)
   goals met: 0 of 7
22. (load obj4 obj9 obj2)
   deleted: (at obj9 obj2)
   added: (in obj9 obj4)
   goals met: 0 of 7
23. (load obj6 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj6)
   goals met: 0 of 7
24. (unload obj15 obj10 obj2)
   deleted: (in obj10 obj15)
   added: (at obj10 obj2)
   goals met: 1 of 7
25. (unload obj15 obj14 obj2)
   deleted: (in obj14 obj15)
   added: (at obj14 obj2)
   goals met: 2 of 7
26. (drive obj4 obj2 obj16)
   deleted: (at obj4 obj2)
   added: (at obj4 obj16)
   goals met: 2 of 7
27. (drive obj6 obj0 obj5)
   deleted: (at obj6 obj0)
   added: (at obj6 obj5)
   goals met: 2 of 7
28. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 2 of 7
29. (drive obj7 obj16 obj2)
   deleted: (at obj7 obj16)
   added: (at obj7 obj2)
   goals met: 2 of 7
30. (unload obj15 obj13 obj0)
   deleted: (in obj13 obj15)
   added: (at obj13 obj0)
   goals met: 3 of 7
31. (unload obj4 obj11 obj16)
   deleted: (in obj11 obj4)
   added: (at obj11 obj16)
   goals met: 4 of 7
32. (unload obj4 obj12 obj16)
   deleted: (in obj12 obj4)
   added: (at obj12 obj16)
   goals met: 5 of 7
33. (unload obj4 obj9 obj16)
   deleted: (in obj9 obj4)
   added: (at obj9 obj16)
   goals met: 6 of 7
34. (unload obj6 obj8 obj5)
   deleted: (in obj8 obj6)
   added: (at obj8 obj5)
   goals met: 7 of 7
